Revit 2027 API
IndexTriangle Constructor
 Constructs the triangle primitive.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IndexTriangle(
	int index0,
	int index1,
	int index2
)
Public Sub New (
	index0 As Integer,
	index1 As Integer,
	index2 As Integer
)
public:
IndexTriangle(
	int index0,
	int index1,
	int index2
)
new :
        index0 : int *
        index1 : int *
        index2 : int -> IndexTriangle
Parameters
index0 Int32
 The index of the triangle's first vertex.
index1 Int32
 The index of the triangle's second vertex.
index2 Int32
 The index of the triangle's third vertex.
See Also
Reference
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace